import streamlit as st
import pandas as pd

st.title('자기소개')

st.write('## 기본 정보')
st.write('**이름**: 주은환')
st.write('**학과**: 인공지능소프트웨어학과')
st.write('**학년**: 3학년')
st.write('---')
st.write('## 이번 학기 시간표')
schedule = pd.DataFrame({
 '요일': ['월', '화', '수', '목', '금'],
 '2교시': ['인공지능 라이브러리', '-', '-', '-', '-'],
 '3교시': ['인공지능 라이브러리', '-', '-', '-', '-'],
 '4교시': ['인공지능 라이브러리', '-', '-', '-', '-'],
 '5교시': ['-', '-', '-', '-', '-'],
 '6교시': ['-', '캡스톤', '-', '인공지능 서비스프로젝트', '빅데이터분석프로젝트'],
 '7교시': ['-', '캡스톤', '-', '인공지능 서비스프로젝트', '빅데이터분석프로젝트'],
 "8교시": ['-', '캡스톤', '-', '인공지능 서비스프로젝트', '빅데이터분석프로젝트'],
 "9교시": ['-', '캡스톤', '-', '-', '-']
})

st.write(schedule)
st.write('---')
st.write('## 관심 분야')
st.write('- 주식')
st.write('- 머신러닝')
st.write('- 웹 개발')
st.write('---')
st.write('## 이번 학기 목표')
goals = pd.DataFrame({
 '목표': ['Streamlit 마스터', '머신 러닝 마스터', '포트폴리오 완성'],
 '달성률': [10, 0, 5]
})
st.write(goals)
st.bar_chart(goals.set_index('목표'))